# 55.装饰器入门
# 在闭包的基础上加一个，有额外功能
# 装饰器本质就是一个闭包函数
# 装饰器的作用就是在不改变原有函数的基础上，给原有函数增加额外功能

# 语法：
# 写法1一：传统写法
# 装饰后函数名 = 装饰器名（装饰前函数名）
# 装饰后函数名（）
# 写法二： 语法糖
# 在要被装饰的函数上直接写@装饰器名之后直接调用原函数即可

# 案例：发表评论和充值前要先登录
def comment():
    print("发表评论。。。。")

# 定义外部函数，形参列表写要被装饰的函数名（对象）
def check_login(fn_name):
    #     定义内部函数
    def fn_inner():
    #     增加额外功能
        print(" 校验登录。。。。")
    #      访问原函数，即外部函数的引用
        fn_name()
    #返回内部函数对象
    return fn_inner

# 测试,写法一
fn_inner = check_login(comment)
fn_inner()

# 56.语法糖写法(底层其实是传统写法)（原函数会被覆盖）
@check_login
def payment():
    print("充值中。。。。")

payment()
